<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.thereal-kcsantos.recipes.jamf.VLC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VLC</string>
		<key>APP_BUNDLE_ID</key>
		<string>org.videolan.vlc</string>
		<key>CATEGORY</key>
		<string>VLC-update-smart</string>
		<key>TRIGGER_NAME</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>VLC</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Testing</string>
		<key>POLICY_CATEGORY</key>
		<string>Install Latest %NAME%</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>STOP_PREDICATE</key>
		<string></string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.VLC</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			<key>Arguments</key>
			<dict>
				<key>computergroup_template</key>
				<string>SmartGroupTemplate-isInstalled.xml</string>
				<key>computergroup_name</key>
				<string>%NAME% - Installed</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
				<key>Arguments</key>
				<dict>
					<key>computergroup_template</key>
					<string>SmartGroupTemplate-notInstalled.xml</string>
					<key>computergroup_name</key>
					<string>%NAME% - Not Installed</string>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_template</key>
				<string>PolicyTemplate-installapp.xml</string>
				<key>policy_name</key>
				<string>Install %NAME%</string>
				<key>frequency</key>
				<string>Ongoing</string>
				<key>policy_category</key>
				<string>%CATEGORY</string>
				<key>trigger_name</key>
				<string>%TRIGGER_NAME%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
