<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.thereal-kcsantos.recipes.jamf.VLC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VLC</string>
		<key>APP_BUNDLE_ID</key>
		<string>org.videolan.vlc</string>
		<key>CATEGORY</key>
		<string>Software</string>
		<key>TRIGGER_NAME</key>
		<string>installApp-%NAME%</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>POLICY_CATEGORY</key>
		<string>Software</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>STOP_PREDICATE</key>
		<string>NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.VLC</string>
	<key>Process</key>
	<array>
	<!--
		<dict>
			<key>Processor</key>
			<string>io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer</string>
		</dict>
	-->
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOP_PREDICATE%</string>
			</dict>
			
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			<key>Arguments</key>
			<dict>
				<key>computergroup_template</key>
				<string>SmartGroupTemplate-isInstalled.xml</string>
				<key>computergroup_name</key>
				<string>%NAME% - Installed</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			<key>Arguments</key>
			<dict>
				<key>computergroup_template</key>
				<string>SmartGroupTemplate-notInstalled.xml</string>
				<key>computergroup_name</key>
				<string>%NAME% - Not Installed</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_template</key>
				<string>PolicyTemplate-installapp.xml</string>
				<key>policy_name</key>
				<string>Install %NAME%</string>
				<key>frequency</key>
				<string>Ongoing</string>
				<key>policy_category</key>
				<string>%CATEGORY</string>
				<key>trigger_name</key>
				<string>%TRIGGER_NAME%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
