Description:
  This recipe downloads the latest version of Visual Studio Code and then uploads the pkg to your Jamf Pro 
  Server/Distribution Point using variables set in the environment.
  The killahquam repo is required.
Identifier: com.github.the-real-kc-santos.jamf.VisualCodeStudio
ParentRecipe: com.github.killahquam.pkg.visualstudioscode
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  CATEGORY: Developer
  POLICY_CATEGORY: Software
  INSTALL_POLICY_TRIGGER: installVisualStudioCode
  SELF_SERVICE_ICON: VisualStudioCode.png
  SELF_SERVICE_DESCRIPTION: |
    Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.

    Version: %version%


Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: "%CATEGORY%"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: "%CATEGORY%"
    jcds_mode: "True"


- Processor: StopProcessingIf
  Arguments:
    predicate: "pkg_uploaded == False"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
      computergroup_name: "App - %NAME% - Not Installed"
      computergroup_template: "smartGroupTemplate-selfService-notInstalled.xml"
      app_name: "%JSS_INVENTORY_NAME%"
      replace_group: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
      computergroup_name: "App - %NAME% - Installed"
      computergroup_template: "smartGroupTemplate-selfService-installed.xml"
      app_name: "%JSS_INVENTORY_NAME%"
      replace_group: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: "App Install - %NAME%"
    policy_template: "policyTemplate-appInstall-allComputersUsers.xml"
    policy_trigger: "%INSTALL_POLICY_TRIGGER%"
    replace_policy: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: "Self Service - %NAME% - Install"
    policy_template: "policyTemplate-selfService-install.xml"
    group_name: "App - %NAME% - Not Installed"
    icon: "%SELF_SERVICE_ICON%"
    replace_policy: "True"
