# Use this as a template to create new recipes.
# Fill out/replace the following Variables:
#   - Description: Add a descritpion of what this recipe will accomplish
#   - Identifier: create a unique identifier to this Recipe
#   - Parent Recipe: Mention the parent -pkg recipe for this recipe. Note that repo of the Parent Recipe
#                    must be trusted and added to the AutoPkg server.
#   - Input:
#       NAME: Input the application name (ie: iTerm2 / Google Chrome / 1Password)
#       CATEGORY: Input the category this PKG will fall under.
#       POLICY_CATEGORY: Input the policy category that is associated with this recipe. (ie: Software)
#       INSTALL_POLICY_TRIGGER: Define the Custom Trigger that will be used to install the associated PKG.
#                               (example: installChrome)
#       SELF_SERVICE_ICON: Input the file name of the icon to be used for Self Service (File must be included
#                          with in the same folder as recipe)
#       SELF_SERVICE_DESCRIPTION: Underneath the |, input the description of the App that will be shown
#                                 Self Service. Do not change the 'Version' variable.
#
#### Delete this line and everything above.

Description:
  This recipe downloads the latest version of Visual Studio Code and then uploads the pkg to your Jamf Pro 
  Server/Distribution Point using variables set in the environment.
  The killahquam repo is required.
Identifier: com.github.the-real-kc-santos.jamf.VisualCodeStudio
ParentRecipe: com.github.killahquam.pkg.visualstudioscode
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  CATEGORY: Developer
  POLICY_CATEGORY: Software
  INSTALL_POLICY_TRIGGER: installVisualStudioCode
  SELF_SERVICE_ICON: VisualStudioCode.png
  SELF_SERVICE_DESCRIPTION: |
    Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.

    Version: %version%


Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: "%CATEGORY%"
    jcds_mode: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: "%CATEGORY%"


- Processor: StopProcessingIf
  Arguments:
    predicate: "pkg_uploaded == False"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
      computergroup_name: "App - %NAME% - Not Installed"
      computergroup_template: "smartGroupTemplate-selfService-notInstalled.xml"
      replace_group: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
      computergroup_name: "App - %NAME% - Installed"
      computergroup_template: "smartGroupTemplate-selfService-installed.xml"
      replace_group: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: "App Install - %NAME%"
    policy_template: "policyTemplate-appInstall-allComputersUsers.xml"
    policy_trigger: "%INSTALL_POLICY_TRIGGER%"
    replace_policy: "True"


- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: "Self Service - %NAME% - Install"
    policy_template: "policyTemplate-selfService-install.xml"
    group_name: "App - %NAME% - Not Installed"
    icon: "%SELF_SERVICE_ICON%"
    replace_policy: "True"
