<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%policy_name%</name>
      <enabled>true</enabled>
      <trigger>EVENT</trigger>
      <trigger_other>%policy_trigger%</trigger_other>
      <frequency>Ongoing</frequency>
      <category>
        <name>%POLICY_CATEGORY%</name>
      </category>
      <site>
        <name>None</name>
      </site>
    </general>
    <scope>
      <all_computers>true</all_computers>
    </scope>
    <package_configuration>
      <packages>
        <size>1</size>
        <package>
          <name>%pkg_name%</name>
          <action>Install</action>
        </package>
      </packages>
    </package_configuration>
    <scripts>
      <size>0</size>
    </scripts>
    <self_service>
      <use_for_self_service>false</use_for_self_service>
    </self_service>
  </policy>