<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%policy_name%</name>
        <enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>%TRIGGER_NAME%</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>false</all_computers>
        <computer_groups/>
            <computer_group>
                <name>%group_name%</name>
            </computer_group>
        </computer_groups>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration/>
    <!-- Scripts -->
    <scripts>
    </scripts>
    <!-- Self Service details -->
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %version%</install_button_text>
        <reinstall_button_text>Reinstall %version%</reinstall_button_text>
        <self_service_display_name>%NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
